ana1/ana1.tex
% Created 2016-10-26 Mi 11:18
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{siunitx}%
\usepackage{fontspec}%
\sisetup{load-configurations = abbrevations}%
\newcommand{\estimates}{\overset{\scriptscriptstyle\wedge}{=}}%
\usepackage{mathtools}%
\DeclarePairedDelimiter\abs{\lvert}{\rvert}%
\DeclarePairedDelimiter\norm{\lVert}{\rVert}%
\DeclareMathOperator{\Exists}{\exists}%
\DeclareMathOperator{\Forall}{\forall}%
\def\colvec#1{\left(\vcenter{\halign{\hfil$##$\hfil\cr \colvecA#1;;}}\right)}
\def\colvecA#1;{\if;#1;\else #1\cr \expandafter \colvecA \fi}
\author{Robin Heinemann}
\date{\today}
\title{Analysis I (Marciniak-Czochra)}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.1.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{Einleitung}
\label{sec-1}
Webseite www.biostruct.uni-heidelberg.de/Analysis1.php
Klausurzulassung: 50\%
Klausur 18.2.2017 9-12Uhr
\section{Mengen und Zahlen}
\label{sec-2}
\subsection{Logische Regeln und Zeichen}
\label{sec-2-1}
\subsubsection{Quantoren}
\label{sec-2-1-1}
\begin{center}
\begin{tabular}{ll}
$\Forall x$ & für alle $x$\\
$\exists x$ & es gibt (mindestens) ein $x$\\
$\exists! x$ & es gibt genau ein $x$\\
\end{tabular}
\end{center}
\subsubsection{Hinreichend und Notwendig}
\label{sec-2-1-2}
\begin{itemize}
\item $A\Rightarrow B$: wenn $A$ gilt, gilt auch $B$, $A$ ist \textbf{hinreichend} für $B$, daraus folgt: $B$ ist \textbf{notwendig} für $A$, Ungültigkeit von $B$ impliziert die Ungültigkeit von $A$ ($\neg B \Rightarrow \neg A$)
\item $A \Leftrightarrow B$: $A$ gilt, genau dann, wenn $B$ gilt
\end{itemize}
\subsubsection{Beweistypen}
\label{sec-2-1-3}
\begin{enumerate}
\item Direkter Schluss
\label{sec-2-1-3-1}
$A\Rightarrow B$
\begin{enumerate}
\item Beispiel
\label{sec-2-1-3-1-1}
$m$ gerade Zahl $\Rightarrow$ $m^2$ gerade Zahl
\begin{enumerate}
\item Beweis
\label{sec-2-1-3-1-1-1}
$m$ gerade $\Rightarrow \exists n\in\mathbb{N}~\text{sodass}~m = 2n \Rightarrow m^2 = 4n^2 = 2k,~\text{wobei}~k=2n^2\in\mathbb{N} \square$
\end{enumerate}
\end{enumerate}
\item Beweis der Transponerten (der Kontraposition)
\label{sec-2-1-3-2}
Zum Beweis $A\Rightarrow B$ zeigt man $\neg B\Rightarrow \neg A~(A\Rightarrow B)\Leftrightarrow (\neg B) \Rightarrow (\neg A)$
\begin{enumerate}
\item Beispiel
\label{sec-2-1-3-2-1}
Sei $m\in\mathbb{N}$, dann gilt $m^2~\text{gerade}~\Rightarrow m~\text{gerade}$
\begin{enumerate}
\item Beweis
\label{sec-2-1-3-2-1-1}
Wir zeigen: $m$ ist ungerade $\Rightarrow m^2$ ungerade
\[\exists n\in\mathbb{N}:~m=2n+1\Rightarrow m^2 = (2n+1)^2 = 2k+1, k=2n^2 + 2n\in\mathbb{N}\Rightarrow m^2~\text{ungerade} \square\]
\end{enumerate}
\end{enumerate}
\item Indirekter Schluss ( Beweis durch Wiederspruch)
\label{sec-2-1-3-3}
Man nimmt an, dass $A\Rightarrow B$ nicht gilt, das heißt $A \wedge \neg B$ und zeigt, dass dann für eine Aussage $C$ gelten muss $C\Rightarrow \neg C$, also ein Wiederspruch
\begin{enumerate}
\item Beispiel
\label{sec-2-1-3-3-1}
$\not\exists q\in\mathbb{Q}: a^2 = 2$
\begin{enumerate}
\item Beweis
\label{sec-2-1-3-3-1-1}
Wir nehmen an, dass $\exists a\in\mathbb{Q}: a^2=2$ Dann folgt:
$\exists b,c\in\mathbb{Z}$ teilfremd (ohne Einschränkung, denn sonst kürzen soweit wie möglich) mit $a=\frac{b}{c}$
Falls \[a^2=2\Rightarrow (\frac{b}{c})^2=2=\frac{b^2}{c^2}=2 \Rightarrow b^2 = 2c^2 \Rightarrow b^2~\text{gerade}~\Rightarrow b~\text{ist gerade (schon gezeight)}\] \[\Rightarrow\exists d\in\mathbb{N}~\text{sodass}~b=2d\Rightarrow b^2=4d^2\]
Außerdem $b^2=2c^2\Rightarrow 2c^2=4d^2\Rightarrow c^2=2d^2\Rightarrow c$ ist auch gerade. Also müssen $b$ und $c$ beide gerade sein, also nicht teilerfremd, damit haben wir einen Widerspruch hergeleitet $\square$
\end{enumerate}
\end{enumerate}
\end{enumerate}
\subsubsection{Summenzeichen und Produktzeichen}
\label{sec-2-1-4}
\begin{enumerate}
\item Summenzeichen
\label{sec-2-1-4-1}
Wir definieren für $m > 0$ \[\sum_{k=m}^m a_k := a_m + \ldots + a_n\] falls $n\geq m$
\[\sum_{k=m}^n a_k := 0\] falls $n < m$ (sogennante leere Summe)
\item Produktzeichen
\label{sec-2-1-4-2}
\[\prod_{k=m}^n a_k := \begin{cases} a_m \cdot ... \cdot a_n & \text{falls}~n\geq m\\ 1 & \text{falls}~n<m~\text{(sog. leeres Produkt)}\end{cases}\]
\end{enumerate}
\subsection{Mengen}
\label{sec-2-2}
\subsubsection{Definition}
\label{sec-2-2-1}
(Georg cantor 1885) Unger einer \uline{Menge} verstehen wir jede Zusammenfassung $M$ von bestimmten wohlunterschiedenen Objekten (welche die Elemente von $M$ genannt werden), zu einem Ganzen
$M$ dadurch ist charakterisiert, dass von jedem vorliegendem Objekt $x$ feststeht, ab gilt
\begin{itemize}
\item $x\in M$ (x Element von M)
\item x \textlnot{}$\in$ M (x kein Element von M)
\end{itemize}
\[M = \{x_1, x_2, \ldots, x_n\}\]
\[M=\{x\mid A(x)\} \rightarrow~\text{eine Menge}~M\text{für die}~x\in\ M \Leftrightarrow A(x)\]
\subsubsection{Mengenrelationen}
\label{sec-2-2-2}
\begin{itemize}
\item Mengeninklusion $A\subseteq M$ ($A$ ist eine Teilmenge von $M$)
\[\Forall x: (x\in A \Rightarrow x\in M)\], zum Beispiel $\mathbb{N} \subseteq \mathbb{Z}$
\item \[A = B \Leftrightarrow \Forall x: (x\in A \Leftrightarrow x\in B)\]
\item \[A \subset M~\text{(strikte Teilmenge)}~\Leftrightarrow A\subset M \wedge A \neq M\]
\item \[\emptyset:~\text{leere Menge}~\not\exists x: x\in\emptyset\]. Wir setzen fest, dass $\emptyset$ eine Teilmenge jeder Menge ist. Zum Beipsiel \[\{x\in\mathbb{R}: x^2 + 1 = 0\}\]
\item Durchschnitt \[A\cup B := \{x\mid x\in A \wedge x\in B\}\]
\item Vereinigung \[A\cap B := \{x \mid x\in A \vee x\in B\}\]
\item Differenz (auch Komplement von $B$ in $A$) \[A\setminus B := \{x\mid x\in A \wedge x\not\in B\} := C_a B~\text{(auch $B^c$)}\]
\end{itemize}
\subsubsection{Potenzmenge}
\label{sec-2-2-3}
Potenzmenge $A$
\[\mathcal{P}(A) := \{B\mid B\subseteq A\}\]
Alle Teilmengen von $A$
\begin{enumerate}
\item Beispiel
\label{sec-2-2-3-1}
\[\mathcal{P}(\{1,2\}) = \{1\}, \{2\}, \{1,2\}, \emptyset\]
\end{enumerate}
\subsubsection{Familien von Mengen}
\label{sec-2-2-4}
Sei $I$ eine Indexmenge, $I \subseteq \mathbb{N}, (A_i)_{i\in I}$ eine Familie von Mengen $A$
\begin{enumerate}
\item Durchschnitt von $A$
\label{sec-2-2-4-1}
\[\cap_{i\in I} = \{x\mid \Forall_{i\in I} x\in A_i\}\]
\item Vereinigung
\label{sec-2-2-4-2}
\[\cup_{i\in I} = \{x\mid\exists i\in I: x\in A_i\}\]
\end{enumerate}
\subsubsection{Rechenregeln}
\label{sec-2-2-5}
$A,B,C,D$ seien Mengen
\begin{itemize}
\item $\emptyset \subseteq A$
\item $A\subseteq A$ \hfill Reflexivität
\item $A\subseteq B, B\subseteq C \Rightarrow A\subseteq C$ \hfill Transitivität
\item $A\cap B = B\cap A$ \\ $A\cup B = B\cup A$ \hfill Kommutativität
\item $(A\cap B)\cap C = A\cap (B\cap C)$ \\ $(A\cup B) \cup C = A\cup (B\cup C)$ \hfill Assoziativität
\item $A\cap (B\cup C) =(A\cap B) \cup (A\cap C)$ \\ $A\cup (B\cap C) =(A\cup B) \cap (A\cup C)$
\item Eigenschaften der Komplementbildung: \\
      Seien $A,B \subseteq D (C_D A: = D\setminus A)$, dann gilt \[C_D (C_D A) = A\] \[C_D(A\cap B) = C_D A \cup C_D B\] \[C_D(A\cup B) = C_D A \cap C_D B\]
\begin{itemize}
\item Beweis:
\[x\in C_D(A\cap B) \Leftrightarrow x\in D \wedge (x\not\in (A\cap B)) \Leftrightarrow x\in D \wedge (x\not\in A \vee x\not\in B)\] \[\Leftrightarrow (c\in D\wedge x\not\in A) \cup x\in D \wedge x\not\in B\] \[\Leftrightarrow x\in D\setminus A \cup x\in D\setminus B \Leftrightarrow x\in D\setminus(A\cup B)~\square\]
\item Bemerkung: Komplement kann man auch mit $A^c$ bezeichnen
\end{itemize}
\end{itemize}
\subsubsection{geordneter Tupel}
\label{sec-2-2-6}
Sei $x_1, x_2, \ldots, x_n$ (nicht notwendig verschiedene) Objekte. Ein geordneter n-Tupel \[(x_1,x_2,\ldots,x_n) = (y_1,\ldots,y_n) \Leftrightarrow x_1 = y_1, \ldots, x_n = y_n\]
Beachte:
\[\{x_1, \ldots, x_n\} = \{y_i,\ldots,y_n\}\not\implies x_1 = y_1, \ldots, x_n = y_n\]
\subsubsection{Kartesisches Produkt}
\label{sec-2-2-7}
Seien \[A_1\times A_2\times \ldots \times A_n = \{(x_1,x_2,\ldots,x_n)\mid x_j \in A_j j\in\mathbb{N}, j \leq n\}\]
\begin{enumerate}
\item Beispiel
\label{sec-2-2-7-1}
\begin{itemize}
\item \[\mathbb{Z}^2 = \mathbb{Z}\times \mathbb{Z}\]
\item $R^n$ m-dimensionaler Raum von reellen Zahlen
\end{itemize}
\end{enumerate}
