ana1/ana1.org
*** Äquivalenzrelation
	Eine Äquivalenzrelation auf eine Menge $A$ ist eine Beziehung zwischen ihren Elementen (Bezeichnung: $a\tilde b$), sodass
	- Für jede zwei $a,b\in A$ gilt entweder $a\tilde b \vee a\not\tilde b$
	- $a\tilde a$ \hfill Reflexivität
	- $a\tilde b \Rightarrow b\tilde a$ \hfill Symmetrie
	- $a\tilde b, b\tilde c \Rightarrow a\tilde c$\hfill Transitivität
    Mit Hilfe einer Äquivalenzrelation lassen sich die Elemente einer Menge in sogenannte Äquivalenzklassen einordnen: $[a]:\{b\in A\mid b\tilde a\}$
** Relationen und Abbildungen
*** Relationen
	Unter einer *Relation* verstehen wir eine Teilmenge $R\subseteq X\times Y$ wobei $X, Y$ Mengen sind. Für $x\in X$ definieren wir, das *Bild* von $x$ unter $R$
	\[R(X) := \{y\in Y | mid (x,y) \in R\}\]
	und *Definitionsbereiche von $R$ (bezüglich $X$)
	\[D(R):= \{x\in X\mid R(x)\neq\emptyset\}\]
*** Graph der Abbildung
	$R\subseteq X\times Y$ heißt Graph der Abbildung (Funktion) \[f:X\rightarrow Y \Leftrightarrow D(R) = X, \Forall x\in X: R(x) = \{f(x)\}\]
	also enthält $R(X)$ genau ein Element. \\
	$X$ heißt Definitionsbereich von $f$ \\
	$Y$ heißt Werte- oder Bildbereich von $f$ (Bild) \\
	$x\in X$ heißt Argument \\
	$f(x)\in Y$ heißt Wert von $f$ an der Stelle x
**** Beispiel
	 $f: \mathbb{R}\rightarrow\mathbb{R}, x\rightarrow x^2$ dann ist der Graph von $f = \{(x,y)\in\mathbb{R^2}, y=x^2\}$
***** Bemerkung
	  \[M^{*}(x) = \{(x,y)\in\mathbb{R}^2;x=y^2\} = \{(x,y)\in\mathbb{R}^2: x \geq 0, y=\sqrt{x} \vee y = -\sqrt{x}\}\]
	  Ist kein Graph einer Funktion $\mathbb{R}\rightarrow\mathbb{R}$, denn $M^{ *}(x) = \{\sqrt{x},-\sqrt{x}, x\geq 0\}$
	  $f$ heißt
	  - surjektiv, wenn gilt $f(X) = Y$
	  - injectiv, $\Forall x_1,x_2\in X: f(x_1) = f(x_2) \Rightarrow x_1 = x_2$
	  - bijektiv, wenn $f$ surjektiv und injectiv ist
*** Umkehrabbildung
	Sei die Abbildung $f: X\rightarrow Y$ bijektiv. Dann definieren wir die Umkehrabbildung $f^{-1}:Y\rightarrow X$ durch $y\rightarrow x\in X$, eindeutig bestimmt durch $y = f(x)$
**** Bemerkung
	 \[(x,y) \in~\text{Graph }f\Leftrightarrow (y,x)\in~\text{Graph }f^{-1}\]
*** Komposition
	Seien $f:X\rightarrow Y, g:Y\rightarrow Z$ Abbildungen. Die Komposition von $g$ und $f$ \[g\circ f: X\rightarrow Z~\text{ist durch}~x\rightarrow g(f(x))~\text{definiert}\]
*** Identitäts Abbildung
	Für jede Menge $X$ definieren wir dei identische Abbildung \[I_d(A) = I_A: A\rightarrow A,~\text{durch}~x\rightarrow x\]
**** Beispiel
	 - \[\{(x,y)\in\mathbb{R}^2\mid x^2 + y^2 = 1\} = S^1\] \[S^{n-1} := \{(x_1 \ldots x_n) \in \mathbb{R}^n; \sum_{i = 1}^n x_i^2 = 1\}\] $(n - 1)$ dimensionale sphere in $\mathbb{R}^n$
	 - Seien $X,Y$ Mengen, $M\subseteq X\times Y, f:M\rightarrow X$ \\ $f$ heißt Projektion, $f$ surjektiv \[f(M) = \{x\mid \exists y \in Y : (x,y) \in M\} = X\]
*** Homomorphe Abbildungen
	Existieren auf Mengen $X$ und $Y$ mit gewissen Operationen $\oplus_x$ bzw. $\oplus_y$ (zum Beispiel AAddition, Ordungsrelation), ho heißt die Abbildung $f:X\to Y$ homomorph (strukturerhaltend), wenn gilt $\Forall x_1,x_2 \in X f(x_1\oplus_x x_2) = f(x_1)\oplus_y f(x_2)$
	Eine bijektive Homomorphie heißt Isomorphisumus, beziehungsweise $X\approx Y$ (äquivalent, isomorph)
** Natürliche Zahlen
   $\mathbb{N} = \{1,2,3,\ldots\},~\mathbb{N}_0 := \mathbb{N}\cup \{0\}$
*** Peanosche Axiomensystem der natürlichen Zahlen
	1. Die Zahl $1$ ist eine natürliche Zahl $1\in\mathbb{N}$
	2. Zu jeder natürlichen Zahl $n$, gibt es genau einen "Nachfolger" $n' (=: n+1)$
	3. Die Zahl 1 ist kein Nachfolger einer natürlichen Zahl
	4. $n' = m' \Rightarrow n = m$
	5. Enthält eine Teilmenge  $M \subseteq \mathbb{N}$ die Zahl $1$ und von jedem $n\in m$ auch den Nachfolger $n'$ ist $M = \mathbb{N}$
	Bemerkung: \\
	Mit Hilfe der Axiome lassen sich auf $\mathbb{N}$ Addition ($+$), Multiplikation ($\cdot$) und Ordung ($\leq$) einführen.
	Wir definieren: \\
	$1' = 2, 2' = 3, \ldots$
	$n + 1 := m'$
	$n + m' := (n+m)';~n\cdot m' := n m + n$
	Man kann zeigen, dass jede Menge, welche die Peano Axiome erfüllt isomorph bezüglich Multiplikation und Addition zu $\mathbb{N}$ ist
	Wir definieren $n < m \Leftrightarrow \exists x\in \mathbb{N}: x + m = m$
*** Vollständige Induktion
**** Induktionsprinzip
	 Es seien die folgende Schritte vollzogen:
	 1. Induktionsverankerung (Induktionsanfang): Die Aussage $A(1)$ gilt
	 2. Induktionsschluss: Ist für ein $n\in\mathbb{N}~A(n)$ gültig, so folgt auch die Gültigkeit von $A(n+1)$
     Dann sind alle Aussagen $A(n),n\in\mathbb{N}$ gültig.
**** Beweis:
	 Wir definieren die Tailmenge $M\subseteq\mathbb{N},~M:=\{n\in \mathbb{N}\mid A(N)~\text{ist gültig}\}$
	 Die Induktionsverankerung besagt, dass $1\in M$ und die Induktionsannahme $n\in M\Rightarrow n + 1 \in M$. Folglich ist nach dem 5. Axiom von Peano $M = \mathbb{N}\hfill\square$
**** Beispiel 1
	 Zu Beweisen: \[\Forall n\in\mathbb{N} \sum_{i = 1}^n i^2 = \frac{n(n+1)(2n+1)}{6}\]
***** Beweis
	  1. Induktionsverankerung: $1^2 = \frac{1}{6}\cdot 1\cdot 2\cdot 3$
	  2. Annahme: $A(n)$ gültig für $n\in\mathbb{N}: \sum_{i = 1}^n i^2 = \frac{n(n+1)(2n+1)}{6}$ \\
		 Zu zeigen $A(n + 1): 1^2 + \ldots + (n+1)^2 = \frac{1}{6} (n+1)(n+2)(2n+3)$
		 \[1^2 + \ldots + n^2 + (n+1)^2 = \frac{1}{2} n(n+1)(2n+1) + (n+1)^2 = (n+1)(\frac{1}{3}n^2 + \frac{1}{6}n + n + 1)\]
		 \[= \frac{1}{6}(n+1)(2n^2+7n+6) = \frac{1}{6}(n+1)(2n+3)(n+2)\hfill\square\]
**** Beispiel 2
	 Definition von Potenzen
	 \[x^0 := 1\]
	 \[\Forall n\in\mathbb{N} x^n := x^{n - 1}x\]
	 (iterative (rekursive) Definition) \\
	 Auf $\mathbb{N}$ sind diese elementaren Operationene erklärt:
	 - Addition $a+b$
	 - Multiplikation $a\cdot b$
	 - (unter gewissen Vorraussetzungen):
	   - Subtraktion $a-b$
	   - Division $\frac{a}{b}$
     $\mathbb{N}$ ist bezüglich "$-$" oder "$/$" nicht vollständig, das heißt $n+x = m$ ist nicht lösbar in $\mathbb{N}$
	 Erweiterungen:
	 - Ganze Zahlen $\mathbb{Z}:=\{0; \pm, n\in\mathbb{N}\}$ \\
	   Negative Zahl $(-n)$ ist definiert duch $n+(-n) = 0$
	 - Rationale Zahlen $\mathbb{Q}~(b x = y)$
     Man sagt, dass $(\mathbb{Q},+,\cdot)$ einen Körper bildet.
*** Definition Körper
	$\mathbb{K}$ sei eine Menge auf der Addition und Multiplikation sei. $\mathbb{K}$ heißt ein Körper, wenn die folgende Axiome erfüllt sind:
	- Addition: $(\mathbb{K}, +)$ ist eine kummutative Gruppe, das heißt $\Forall a,b,c\in \mathbb{K}$:
	  1. \((a+b)+c = a+(b+c)\) \hfill Assoziativität
	  2. \(a+b = b+a\) \hfill Kommutativität
	  3. \(\exists! 0\in\mathbb{K}:a+0 = a\)\hfill Existenz des Nullelement
	  4. \(\exists x\in\mathbb{K}: a+x = 0\)\hfill Existstenz des Nagativen
	- Multiplikation: $(\mathbb{K}\setminus\{0\},\cdot)$ ist eine kommutative Gruppte, das heißt $\Forall a,b,c\in\mathbb{K}$
	  1. \((a\cdot b)\cdot c = a\cdot(b\cdot c)\)\hfill Assozativität
	  2. \(a\cdot b = b\cdot a\)\hfill Kummutativität
	  3. \(\exists!1\in\mathbb{K}:a\cdot 1 = a\)\hfill Existenz des Einselement
	  4. Für \(a\neq 0, \exists! y\in\mathbb{K}:a\cdot y = 1\)\hfill Inverse
	- Verträglichkeit
	  1. \(a\cdot (b + c) = (a\cdot b)+ (a\cdot c)\)\hfill Distributivität
