ana1/ana1.tex
\subsubsection{Äquivalenzrelation}
\label{sec-2-2-8}
Eine Äquivalenzrelation auf eine Menge $A$ ist eine Beziehung zwischen ihren Elementen (Bezeichnung: $a\tilde b$), sodass
\begin{itemize}
\item Für jede zwei $a,b\in A$ gilt entweder $a\tilde b \vee a\not\tilde b$
\item $a\tilde a$ \hfill Reflexivität
\item $a\tilde b \Rightarrow b\tilde a$ \hfill Symmetrie
\item \$a\textasciitilde{} b, b\textasciitilde{} c $\Rightarrow$ a\textasciitilde{} c\$\hfill Transitivität
\end{itemize}
Mit Hilfe einer Äquivalenzrelation lassen sich die Elemente einer Menge in sogenannte Äquivalenzklassen einordnen: $[a]:\{b\in A\mid b\tilde a\}$
\subsection{Relationen und Abbildungen}
\label{sec-2-3}
\subsubsection{Relationen}
\label{sec-2-3-1}
Unter einer \textbf{Relation} verstehen wir eine Teilmenge $R\subseteq X\times Y$ wobei $X, Y$ Mengen sind. Für $x\in X$ definieren wir, das \textbf{Bild} von $x$ unter $R$
\[R(X) := \{y\in Y | mid (x,y) \in R\}\]
und *Definitionsbereiche von $R$ (bezüglich $X$)
\[D(R):= \{x\in X\mid R(x)\neq\emptyset\}\]
\subsubsection{Graph der Abbildung}
\label{sec-2-3-2}
$R\subseteq X\times Y$ heißt Graph der Abbildung (Funktion) \[f:X\rightarrow Y \Leftrightarrow D(R) = X, \Forall x\in X: R(x) = \{f(x)\}\]
also enthält $R(X)$ genau ein Element. \\
    $X$ heißt Definitionsbereich von $f$ \\
    $Y$ heißt Werte- oder Bildbereich von $f$ (Bild) \\
    $x\in X$ heißt Argument \\
    $f(x)\in Y$ heißt Wert von $f$ an der Stelle x
\begin{enumerate}
\item Beispiel
\label{sec-2-3-2-1}
$f: \mathbb{R}\rightarrow\mathbb{R}, x\rightarrow x^2$ dann ist der Graph von $f = \{(x,y)\in\mathbb{R^2}, y=x^2\}$
\begin{enumerate}
\item Bemerkung
\label{sec-2-3-2-1-1}
\[M^{*}(x) = \{(x,y)\in\mathbb{R}^2;x=y^2\} = \{(x,y)\in\mathbb{R}^2: x \geq 0, y=\sqrt{x} \vee y = -\sqrt{x}\}\]
Ist kein Graph einer Funktion $\mathbb{R}\rightarrow\mathbb{R}$, denn $M^{ *}(x) = \{\sqrt{x},-\sqrt{x}, x\geq 0\}$
$f$ heißt
\begin{itemize}
\item surjektiv, wenn gilt $f(X) = Y$
\item injectiv, $\Forall x_1,x_2\in X: f(x_1) = f(x_2) \Rightarrow x_1 = x_2$
\item bijektiv, wenn $f$ surjektiv und injectiv ist
\end{itemize}
\end{enumerate}
\end{enumerate}
\subsubsection{Umkehrabbildung}
\label{sec-2-3-3}
Sei die Abbildung $f: X\rightarrow Y$ bijektiv. Dann definieren wir die Umkehrabbildung $f^{-1}:Y\rightarrow X$ durch $y\rightarrow x\in X$, eindeutig bestimmt durch $y = f(x)$
\begin{enumerate}
\item Bemerkung
\label{sec-2-3-3-1}
\[(x,y) \in~\text{Graph }f\Leftrightarrow (y,x)\in~\text{Graph }f^{-1}\]
\end{enumerate}
\subsubsection{Komposition}
\label{sec-2-3-4}
Seien $f:X\rightarrow Y, g:Y\rightarrow Z$ Abbildungen. Die Komposition von $g$ und $f$ \[g\circ f: X\rightarrow Z~\text{ist durch}~x\rightarrow g(f(x))~\text{definiert}\]
\subsubsection{Identitäts Abbildung}
\label{sec-2-3-5}
Für jede Menge $X$ definieren wir dei identische Abbildung \[I_d(A) = I_A: A\rightarrow A,~\text{durch}~x\rightarrow x\]
\begin{enumerate}
\item Beispiel
\label{sec-2-3-5-1}
\begin{itemize}
\item \[\{(x,y)\in\mathbb{R}^2\mid x^2 + y^2 = 1\} = S^1\] \[S^{n-1} := \{(x_1 \ldots x_n) \in \mathbb{R}^n; \sum_{i = 1}^n x_i^2 = 1\}\] $(n - 1)$ dimensionale sphere in $\mathbb{R}^n$
\item Seien $X,Y$ Mengen, $M\subseteq X\times Y, f:M\rightarrow X$ \\ $f$ heißt Projektion, $f$ surjektiv \[f(M) = \{x\mid \exists y \in Y : (x,y) \in M\} = X\]
\end{itemize}
\end{enumerate}
\subsubsection{Homomorphe Abbildungen}
\label{sec-2-3-6}
Existieren auf Mengen $X$ und $Y$ mit gewissen Operationen $\oplus_x$ bzw. $\oplus_y$ (zum Beispiel AAddition, Ordungsrelation), ho heißt die Abbildung $f:X\to Y$ homomorph (strukturerhaltend), wenn gilt $\Forall x_1,x_2 \in X f(x_1\oplus_x x_2) = f(x_1)\oplus_y f(x_2)$
Eine bijektive Homomorphie heißt Isomorphisumus, beziehungsweise $X\approx Y$ (äquivalent, isomorph)
\subsection{Natürliche Zahlen}
\label{sec-2-4}
$\mathbb{N} = \{1,2,3,\ldots\},~\mathbb{N}_0 := \mathbb{N}\cup \{0\}$
\subsubsection{Peanosche Axiomensystem der natürlichen Zahlen}
\label{sec-2-4-1}
\begin{enumerate}
\item Die Zahl $1$ ist eine natürliche Zahl $1\in\mathbb{N}$
\item Zu jeder natürlichen Zahl $n$, gibt es genau einen "Nachfolger" $n' (=: n+1)$
\item Die Zahl 1 ist kein Nachfolger einer natürlichen Zahl
\item $n' = m' \Rightarrow n = m$
\item Enthält eine Teilmenge  $M \subseteq \mathbb{N}$ die Zahl $1$ und von jedem $n\in m$ auch den Nachfolger $n'$ ist $M = \mathbb{N}$
\end{enumerate}
Bemerkung: \\
    Mit Hilfe der Axiome lassen sich auf $\mathbb{N}$ Addition ($+$), Multiplikation ($\cdot$) und Ordung ($\leq$) einführen.
Wir definieren: \\
    $1' = 2, 2' = 3, \ldots$
$n + 1 := m'$
$n + m' := (n+m)';~n\cdot m' := n m + n$
Man kann zeigen, dass jede Menge, welche die Peano Axiome erfüllt isomorph bezüglich Multiplikation und Addition zu $\mathbb{N}$ ist
Wir definieren $n < m \Leftrightarrow \exists x\in \mathbb{N}: x + m = m$
\subsubsection{Vollständige Induktion}
\label{sec-2-4-2}
\begin{enumerate}
\item Induktionsprinzip
\label{sec-2-4-2-1}
Es seien die folgende Schritte vollzogen:
\begin{enumerate}
\item Induktionsverankerung (Induktionsanfang): Die Aussage $A(1)$ gilt
\item Induktionsschluss: Ist für ein $n\in\mathbb{N}~A(n)$ gültig, so folgt auch die Gültigkeit von $A(n+1)$
\end{enumerate}
Dann sind alle Aussagen $A(n),n\in\mathbb{N}$ gültig.
\item Beweis:
\label{sec-2-4-2-2}
Wir definieren die Tailmenge $M\subseteq\mathbb{N},~M:=\{n\in \mathbb{N}\mid A(N)~\text{ist gültig}\}$
Die Induktionsverankerung besagt, dass $1\in M$ und die Induktionsannahme $n\in M\Rightarrow n + 1 \in M$. Folglich ist nach dem 5. Axiom von Peano $M = \mathbb{N}\hfill\square$
\item Beispiel 1
\label{sec-2-4-2-3}
Zu Beweisen: \[\Forall n\in\mathbb{N} \sum_{i = 1}^n i^2 = \frac{n(n+1)(2n+1)}{6}\]
\begin{enumerate}
\item Beweis
\label{sec-2-4-2-3-1}
\begin{enumerate}
\item Induktionsverankerung: $1^2 = \frac{1}{6}\cdot 1\cdot 2\cdot 3$
\item Annahme: $A(n)$ gültig für $n\in\mathbb{N}: \sum_{i = 1}^n i^2 = \frac{n(n+1)(2n+1)}{6}$ \\
         Zu zeigen $A(n + 1): 1^2 + \ldots + (n+1)^2 = \frac{1}{6} (n+1)(n+2)(2n+3)$
         \[1^2 + \ldots + n^2 + (n+1)^2 = \frac{1}{2} n(n+1)(2n+1) + (n+1)^2 = (n+1)(\frac{1}{3}n^2 + \frac{1}{6}n + n + 1)\]
         \[= \frac{1}{6}(n+1)(2n^2+7n+6) = \frac{1}{6}(n+1)(2n+3)(n+2)\hfill\square\]
\end{enumerate}
\end{enumerate}
\item Beispiel 2
\label{sec-2-4-2-4}
Definition von Potenzen
\[x^0 := 1\]
\[\Forall n\in\mathbb{N} x^n := x^{n - 1}x\]
(iterative (rekursive) Definition) \\
     Auf $\mathbb{N}$ sind diese elementaren Operationene erklärt:
\begin{itemize}
\item Addition $a+b$
\item Multiplikation $a\cdot b$
\item (unter gewissen Vorraussetzungen):
\begin{itemize}
\item Subtraktion $a-b$
\item Division $\frac{a}{b}$
\end{itemize}
\end{itemize}
$\mathbb{N}$ ist bezüglich "$-$" oder "$/$" nicht vollständig, das heißt $n+x = m$ ist nicht lösbar in $\mathbb{N}$
Erweiterungen:
\begin{itemize}
\item Ganze Zahlen $\mathbb{Z}:=\{0; \pm, n\in\mathbb{N}\}$ \\
       Negative Zahl $(-n)$ ist definiert duch $n+(-n) = 0$
\item Rationale Zahlen $\mathbb{Q}~(b x = y)$
\end{itemize}
Man sagt, dass $(\mathbb{Q},+,\cdot)$ einen Körper bildet.
\end{enumerate}
\subsubsection{Definition Körper}
\label{sec-2-4-3}
$\mathbb{K}$ sei eine Menge auf der Addition und Multiplikation sei. $\mathbb{K}$ heißt ein Körper, wenn die folgende Axiome erfüllt sind:
\begin{itemize}
\item Addition: $(\mathbb{K}, +)$ ist eine kummutative Gruppe, das heißt $\Forall a,b,c\in \mathbb{K}$:
\begin{enumerate}
\item \((a+b)+c = a+(b+c)\) \hfill Assoziativität
\item \(a+b = b+a\) \hfill Kommutativität
\item \(\exists! 0\in\mathbb{K}:a+0 = a\)\hfill Existenz des Nullelement
\item \(\exists x\in\mathbb{K}: a+x = 0\)\hfill Existstenz des Nagativen
\end{enumerate}
\item Multiplikation: $(\mathbb{K}\setminus\{0\},\cdot)$ ist eine kommutative Gruppte, das heißt $\Forall a,b,c\in\mathbb{K}$
\begin{enumerate}
\item \((a\cdot b)\cdot c = a\cdot(b\cdot c)\)\hfill Assozativität
\item \(a\cdot b = b\cdot a\)\hfill Kummutativität
\item \(\exists!1\in\mathbb{K}:a\cdot 1 = a\)\hfill Existenz des Einselement
\item Für \(a\neq 0, \exists! y\in\mathbb{K}:a\cdot y = 1\)\hfill Inverse
\end{enumerate}
\item Verträglichkeit
\begin{enumerate}
\item \(a\cdot (b + c) = (a\cdot b)+ (a\cdot c)\)\hfill Distributivität
\end{enumerate}
\end{itemize}
\begin{enumerate}
\item Satz
\label{sec-2-4-3-1}
