ana1/ana1.tex
$(\mathbb{Q},+,\cdot)$ ist ein Körper. Definieren auf $\mathbb{Q}$ eine Ordnung "$\leq$" duch \[x\leq y \Leftrightarrow\exists m\in\mathbb{N}_0, n\in\mathbb{N}:y - x = \frac{m}{n}\]
dann ist auch diese Ordnung mit der Addition und Multiplikation in $\mathbb{Q}$ in folgendem Sinne verträglich:
\begin{itemize}
\item \(a\leq b\Rightarrow a+c \leq b + c\)
\item \(0\leq a\wedge 0\leq b \Rightarrow 0\leq a\cdot b\)
\end{itemize}
\item Bemerkung
\label{sec-2-4-3-2}
\[\{a\in\mathbb{Q}: a = \frac{r}{s},r\in\mathbb{N}_0,s\in\mathbb{N}\} =: \mathbb{Q}_+ (\mathbb{Q}_{\geq 0})\]
\end{enumerate}
\subsection{Abzählbarkeit}
\label{sec-2-5}
\subsubsection{Abzählbarkeit von Mengen}
\label{sec-2-5-1}
Sei $A$ eine Menge\\
\begin{itemize}
\item $A$ heißt endlich mit $\abs{A} = n$ Elementen ist äquivalent zu
\[\abs{A} = \begin{cases} A = \emptyset &(n = 0) \\ \exists f:A\to \{1,\ldots,n\} &f~\text{bijektiv},n < \infty\end{cases}\]
\item $A$ heißt abzählbar undendlich genau dann wenn \[\exists f: A\to \mathbb{N}~\text{bijektiv}\]
\item $A$ heißt überabzählbar genau dann wenn: $A$ ist weder endlich oder abzählbar unendlich
\end{itemize}
\subsubsection{Beispiel}
\label{sec-2-5-2}
$\mathbb{Z}$ ist abzählbar unendlich
\begin{enumerate}
\item Beweis
\label{sec-2-5-2-1}
Die Abbildung $f:\mathbb{Z}\to\mathbb{N}$
\[z\mapsto \begin{cases} 2z & z\geq 0\\ -2z - 1 & 2 < 0\end{cases}\]
\begin{itemize}
\item Surjektivität: zu zeigen $f(\mathbb{Z}) = \mathbb{N}$ \\
       Offenbar $f(\mathbb{Z}) \subseteq \mathbb{N}$. Wir zeigen $\mathbb{N} \subseteq f(\mathbb{Z})$. Sei $n\in\mathbb{N}$, finde $z\in\mathbb{Z}$ mit $f(z) = n$.
Man unterscheide:
\begin{itemize}
\item n gerade $\rightarrow$ Wähle $z=\frac{n}{2}$
\item n ungerade $\rightarrow$ $z=-\frac{n + 1}{2}$
\end{itemize}
\item Injektivität: Sei $z_1,z_2 \in\mathbb{Z}$ und $f(z_1) = f(z_2)$ \\
       ohne Beschränkung der Allgemeinheit $z_1 \leq z_2$. Entweder $z_1,z_2 \geq 0$ oder $z_1,z_2 < 0$, denn sonst währe $f(z_1)$ ungerade und $f(z_1)$ gerade \textbf{Wiederspruch}.
Falls
\begin{itemize}
\item $z_1,z-2 \geq 0 \Rightarrow 2z_1 = f(z_1) = f(z_2) = 2z_2 \Rightarrow z_1 = z_2$
\item $z_1,z-2 < 0 \Rightarrow -2z_1 -1 = f(z_1) = f(z_2) = -2z_2-1 \Rightarrow z_1 = z_2 \hfill\square$
\end{itemize}
\end{itemize}
\end{enumerate}
\subsubsection{Beispiel}
\label{sec-2-5-3}
\begin{itemize}
\item $\mathbb{N}^2 = \mathbb{N}\times\mathbb{N}$ abzählbar unendlich
\item $\mathbb{Q}$ abzählbar unendlich
\item $\mathbb{R}$ überabzählbar
\end{itemize}
% Emacs 25.1.1 (Org mode 8.2.10)
\end{document}